# ─────────────────────────────────────────────────────────────
# Brewfile — declarative macOS package manifest
# Usage: brew bundle install --file=Brewfile
# ─────────────────────────────────────────────────────────────

# System / CLI
brew "git"
brew "mise"                     # toolchain manager (node, python, go, ...)
brew "uv"                       # python env & package manager
brew "starship"                 # shell prompt
brew "swiftlint"                # swift linter

# Modern CLI essentials
brew "fzf"                      # fuzzy finder — ctrl+r history, ctrl+t file search
brew "ripgrep"                  # faster grep (rg)
brew "bat"                      # better cat — syntax highlighting, line numbers
brew "eza"                      # better ls — colors, git status, icons

# Media
brew "ffmpeg"                   # video/audio processing

# Fonts
cask "font-meslo-lg-nerd-font"  # required for starship icons

# Applications
cask "orbstack"                 # docker runtime + linux VMs
cask "visual-studio-code"
cask "google-chrome"
cask "maccy"                    # clipboard manager
cask "chatgpt"
cask "antigravity"
cask "blip"
cask "logi-options+"
cask "rive"
cask "codex-app"
cask "copilot-cli"
cask "claude-code"
cask "tailscale-app"                # VPN / mesh networking

# VS Code extensions
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
brew "mole"
cask "cmake"
brew "ninja"
brew "vcpkg"
brew "llvm"
brew "pkg-config"
brew "cxxopts"
